Tekla.Structures.PropertyTypeEnum
The type of property: int/double/string.

Tekla.Structures.PropertyTypeEnum.TYPE_INT
The integer property type.

Tekla.Structures.PropertyTypeEnum.TYPE_DOUBLE
The double property type.

Tekla.Structures.PropertyTypeEnum.TYPE_STRING
The string property type.